FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/qspi_reg.h
#define QSPI_CTL_CLKPOL_Pos          ( 3 )                                                  /*!< QSPI_T::CTL: CLKPOL Position            */
#define QSPI_CTL_CLKPOL_Msk          ( 0x1ul << QSPI_CTL_CLKPOL_Pos )                       /*!< QSPI_T::CTL: CLKPOL Mask                */

#define QSPI_CTL_SUSPITV_Pos         ( 4 )                                                  /*!< QSPI_T::CTL: SUSPITV Position           */
#define QSPI_CTL_SUSPITV_Msk         ( 0xful << QSPI_CTL_SUSPITV_Pos )                      /*!< QSPI_T::CTL: SUSPITV Mask               */

#define QSPI_CTL_DWIDTH_Pos          ( 8 )                                                  /*!< QSPI_T::CTL: DWIDTH Position            */
#define QSPI_CTL_DWIDTH_Msk          ( 0x1ful << QSPI_CTL_DWIDTH_Pos )                      /*!< QSPI_T::CTL: DWIDTH Mask                */

#define QSPI_CTL_LSB_Pos             ( 13 )                                                 /*!< QSPI_T::CTL: LSB Position               */
#define QSPI_CTL_LSB_Msk             ( 0x1ul << QSPI_CTL_LSB_Pos )                          /*!< QSPI_T::CTL: LSB Mask                   */

#define QSPI_CTL_HALFDPX_Pos         ( 14 )                                                 /*!< QSPI_T::CTL: HALFDPX Position           */
#define QSPI_CTL_HALFDPX_Msk         ( 0x1ul << QSPI_CTL_HALFDPX_Pos )                      /*!< QSPI_T::CTL: HALFDPX Mask               */

#define QSPI_CTL_RXONLY_Pos          ( 15 )                                                 /*!< QSPI_T::CTL: RXONLY Position            */
#define QSPI_CTL_RXONLY_Msk          ( 0x1ul << QSPI_CTL_RXONLY_Pos )                       /*!< QSPI_T::CTL: RXONLY Mask                */

#define QSPI_CTL_TWOBIT_Pos          ( 16 )                                                 /*!< QSPI_T::CTL: TWOBIT Position            */
#define QSPI_CTL_TWOBIT_Msk          ( 0x1ul << QSPI_CTL_TWOBIT_Pos )                       /*!< QSPI_T::CTL: TWOBIT Mask                */

#define QSPI_CTL_UNITIEN_Pos         ( 17 )                                                 /*!< QSPI_T::CTL: UNITIEN Position           */
#define QSPI_CTL_UNITIEN_Msk         ( 0x1ul << QSPI_CTL_UNITIEN_Pos )                      /*!< QSPI_T::CTL: UNITIEN Mask               */

#define QSPI_CTL_SLAVE_Pos           ( 18 )                                                 /*!< QSPI_T::CTL: SLAVE Position             */
#define QSPI_CTL_SLAVE_Msk           ( 0x1ul << QSPI_CTL_SLAVE_Pos )                        /*!< QSPI_T::CTL: SLAVE Mask                 */

#define QSPI_CTL_REORDER_Pos         ( 19 )                                                 /*!< QSPI_T::CTL: REORDER Position           */
#define QSPI_CTL_REORDER_Msk         ( 0x1ul << QSPI_CTL_REORDER_Pos )                      /*!< QSPI_T::CTL: REORDER Mask               */

#define QSPI_CTL_DATDIR_Pos          ( 20 )                                                 /*!< QSPI_T::CTL: DATDIR Position            */
#define QSPI_CTL_DATDIR_Msk          ( 0x1ul << QSPI_CTL_DATDIR_Pos )                       /*!< QSPI_T::CTL: DATDIR Mask                */

#define QSPI_CTL_DUALIOEN_Pos        ( 21 )                                                 /*!< QSPI_T::CTL: DUALIOEN Position          */
#define QSPI_CTL_DUALIOEN_Msk        ( 0x1ul << QSPI_CTL_DUALIOEN_Pos )                     /*!< QSPI_T::CTL: DUALIOEN Mask              */

#define QSPI_CTL_QUADIOEN_Pos        ( 22 )                                                 /*!< QSPI_T::CTL: QUADIOEN Position          */
#define QSPI_CTL_QUADIOEN_Msk        ( 0x1ul << QSPI_CTL_QUADIOEN_Pos )                     /*!< QSPI_T::CTL: QUADIOEN Mask              */

#define QSPI_CLKDIV_DIVIDER_Pos      ( 0 )                                                  /*!< QSPI_T::CLKDIV: DIVIDER Position        */
#define QSPI_CLKDIV_DIVIDER_Msk      ( 0x1fful << QSPI_CLKDIV_DIVIDER_Pos )                 /*!< QSPI_T::CLKDIV: DIVIDER Mask            */

#define QSPI_SSCTL_SS_Pos            ( 0 )                                                  /*!< QSPI_T::SSCTL: SS Position              */
#define QSPI_SSCTL_SS_Msk            ( 0x1ul << QSPI_SSCTL_SS_Pos )                         /*!< QSPI_T::SSCTL: SS Mask                  */

#define QSPI_SSCTL_SSACTPOL_Pos      ( 2 )                                                  /*!< QSPI_T::SSCTL: SSACTPOL Position        */
#define QSPI_SSCTL_SSACTPOL_Msk      ( 0x1ul << QSPI_SSCTL_SSACTPOL_Pos )                   /*!< QSPI_T::SSCTL: SSACTPOL Mask            */

#define QSPI_SSCTL_AUTOSS_Pos        ( 3 )                                                  /*!< QSPI_T::SSCTL: AUTOSS Position          */
#define QSPI_SSCTL_AUTOSS_Msk        ( 0x1ul << QSPI_SSCTL_AUTOSS_Pos )                     /*!< QSPI_T::SSCTL: AUTOSS Mask              */

#define QSPI_SSCTL_SLV3WIRE_Pos      ( 4 )                                                  /*!< QSPI_T::SSCTL: SLV3WIRE Position        */
#define QSPI_SSCTL_SLV3WIRE_Msk      ( 0x1ul << QSPI_SSCTL_SLV3WIRE_Pos )                   /*!< QSPI_T::SSCTL: SLV3WIRE Mask            */

#define QSPI_SSCTL_SLVTOIEN_Pos      ( 5 )                                                  /*!< QSPI_T::SSCTL: SLVTOIEN Position        */
#define QSPI_SSCTL_SLVTOIEN_Msk      ( 0x1ul << QSPI_SSCTL_SLVTOIEN_Pos )                   /*!< QSPI_T::SSCTL: SLVTOIEN Mask            */

#define QSPI_SSCTL_SLVTORST_Pos      ( 6 )                                                  /*!< QSPI_T::SSCTL: SLVTORST Position        */
#define QSPI_SSCTL_SLVTORST_Msk      ( 0x1ul << QSPI_SSCTL_SLVTORST_Pos )                   /*!< QSPI_T::SSCTL: SLVTORST Mask            */

#define QSPI_SSCTL_SLVBEIEN_Pos      ( 8 )                                                  /*!< QSPI_T::SSCTL: SLVBEIEN Position        */
#define QSPI_SSCTL_SLVBEIEN_Msk      ( 0x1ul << QSPI_SSCTL_SLVBEIEN_Pos )                   /*!< QSPI_T::SSCTL: SLVBEIEN Mask            */

#define QSPI_SSCTL_SLVURIEN_Pos      ( 9 )                                                  /*!< QSPI_T::SSCTL: SLVURIEN Position        */
#define QSPI_SSCTL_SLVURIEN_Msk      ( 0x1ul << QSPI_SSCTL_SLVURIEN_Pos )                   /*!< QSPI_T::SSCTL: SLVURIEN Mask            */

#define QSPI_SSCTL_SSACTIEN_Pos      ( 12 )                                                 /*!< QSPI_T::SSCTL: SSACTIEN Position        */
#define QSPI_SSCTL_SSACTIEN_Msk      ( 0x1ul << QSPI_SSCTL_SSACTIEN_Pos )                   /*!< QSPI_T::SSCTL: SSACTIEN Mask            */

